{"chapters": [{"summary": "Lufthansa Allegris sums up your travel in two words truly yours. All four travel classes have been rethought, so the flight is a genuinely personal journey. Squarespace is the all in one platform for building your brand and growing your business online.", "gist": "Lufthansa Allegris", "headline": "Lufthansa Allegris is a completely new travel experience", "start": 1690, "end": 82306}, {"summary": "David Daniels was nine years old when a stranger gave him a comic book. The stranger had given him a Chick Tract. Today, David is still a Christian. There are countless people who have been impacted by a Chick tract.", "gist": "The Stranger Who Read Me My Life In Heaven", "headline": "David Daniels was nine years old when he received a Christian comic book", "start": 82418, "end": 466930}, {"summary": "Jack Chick was the creator of Chick tracks and some of the most influential Christian lit of the 20th century. The story of his conversion begins when he's well into his 20s. In the decade that followed, his conversion would inspire him to change nearly everything about his life.", "gist": "The True Story of Jack Chick", "headline": "Jack Chick, creator of Chick tracks, converted to Christianity in 1940s", "start": 467430, "end": 1075438}, {"summary": "Jack Chick saw himself as a soldier in a holy war. His targets included anything he associated with sorcery or the occult. Another of his consistent targets was homosexuality. His comics are much darker, uglier, and honestly dangerous.", "gist": "The Life of Chuck Chick", "headline": "Jack Chick's early comics targeted anything associated with sorcery or the occult", "start": 1075614, "end": 1477480}, {"summary": "Green Mountain Grenco has all natural ingredients. The hot salsa brings flavorful heat to every meal. Even has their own tortilla strips made with stone ground all natural yellow cornflower. Plus, a hot sauce with a tangy, spicy flavor that enhances the simplest of meals.", "gist": "Green Mountain Gringo Salsa", "headline": "Green Mountain Gringo offers a variety of flavors and heat levels", "start": 1490410, "end": 1536658}, {"summary": "Kachava is a plant based super blend made up of superfoods greens, proteins, omegas, vitamins, minerals, antioxidants, and probiotics. Kachava. com is offering 10% off for a limited time. For 23% off that's promo code podcast 23.", "gist": "Kachava SuperBlend", "headline": "Kachava super blend is all your daily nutrients in a glass", "start": 1536754, "end": 1612670}, {"summary": "With annuity and life insurance solutions from Lincoln Financial, you're also helping yourself out. Article is offering 99% of visible listeners $50 off your first purchase of $100 or more. Go to LincolnFinancial. com slash get started now to learn how to plan, protect and retire.", "gist": "Article Furniture", "headline": "With annuity and life insurance solutions from Lincoln Financial, you're helping yourself out", "start": 1619750, "end": 1731670}, {"summary": "Jack Chick's decision to cut his comic books down to pocket sized booklets helped launch Chick tracks out into the world. The newly reformatted comics were perfect tools for proselytizing. Chick publications is really taking off.", "gist": "Jack Chick's Chick Tracks: Small Format Comics", "headline": "Jack Chick's decision to cut his comics down to pocket sized helped launch Chick tracks", "start": 1731750, "end": 2285370}, {"summary": "This week's 99 Pi features Jack Chick, Amica insurance, and the new Toyota Grand Highlander. Earn free food with the McDonald's app at participating McDonald's. Find the show and join discussions about the show on Facebook.", "gist": "99 Pi", "headline": "Roman Mars: Amica is a different type of insurance company", "start": 2287740, "end": 2491940}], "episode_thumbnail": "https://production.listennotes.com/podcasts/99-invisible-roman-mars-vQyoZCSNjaI-JqxekyhmQi1.300x300.jpg", "episode_title": "544- Chick Tracts", "podcast_title": "99% Invisible"}