{"chapters": [{"summary": "Lufthansa Allegris sums up your travel in two words truly yours. All four travel classes have been rethought, so the flight is a genuinely personal journey. Squarespace is the all in one platform for building your brand and growing your business online.", "gist": "Lufthansa Allegris", "headline": "Lufthansa Allegris is a completely new travel experience", "start": 1690, "end": 82306}, {"summary": "David Daniels was nine years old when a stranger gave him a comic book. The stranger had given him a Chick Tract. Today, David is still a Christian. There are countless people who have been impacted by a Chick tract.", "gist": "The Stranger Who Read Me My Life In Heaven", "headline": "David Daniels was nine years old when he received a Christian comic book", "start": 82418, "end": 466930}, {"summary": "Jack Chick was the creator of Chick tracks and some of the most influential Christian lit of the 20th century. The story of his conversion begins when he's well into his 20s. In the decade that followed, his conversion would inspire him to change nearly everything about his life.", "gist": "The True Story of Jack Chick", "headline": "Jack Chick, creator of Chick tracks, converted to Christianity in 1940s", "start": 467430, "end": 1075438}, {"summary": "Jack Chick saw himself as a soldier in a holy war. His targets included anything he associated with sorcery or the occult. Another of his consistent targets was homosexuality. His comics are some of the best work he ever did.", "gist": "The Life of Charles Chick", "headline": "Jack Chick's Christian tracts attacked many religions, including Islam and homosexuality", "start": 1075614, "end": 1546970}, {"summary": "Eating a heart healthy breakfast like a bowl of Honey Nut Cheerios can help set you up to make better choices throughout the day. Article is offering 99% invisible listeners $50 off your first purchase of $100 or more. Go to LincolnFinancial. com slash get started now to learn how to plan, protect and retire.", "gist": "Honey Nut Cheerios and Annuity", "headline": "With annuity and life insurance solutions from Lincoln Financial, you're helping yourself out", "start": 1554050, "end": 1697490}, {"summary": "Jack Chick's decision to cut his comic books down to pocket sized booklets helped launch Chick tracks out into the world. The newly reformatted comics were perfect tools for proselytizing. These little comics were great for shy Christians.", "gist": "Jack Chick's Chick Tracks: Small Format Comics", "headline": "Jack Chick's innovative Chick tracks were perfect tools for proselytizing", "start": 1697570, "end": 2251220}, {"summary": "Jack Chick has been called a lot of things in the press over the last 60 years. His tracks are just as complicated, shocking, graphic, hateful, and just plain mean. Working in spirit, you can see him and have him in the 99% Invisible.", "gist": "99% Invisible", "headline": "The 99% Invisible podcast is hosted by Roman Mars and produced by Christopher Johnson", "start": 2253510, "end": 2385360}, {"summary": "More than 113,000 children are waiting to be adopted from foster care. More than 20,000 teens age out of care every year. Ellie was adopted with help from the Dave Thomas Foundation for adoption. You can help visit Davethomasfoundation. org.", "gist": "Choose the Oil That Sets You Up for Success", "headline": "More than 113,000 children are waiting to be adopted from foster care", "start": 2387490, "end": 2487690}], "episode_thumbnail": "https://production.listennotes.com/podcasts/99-invisible-roman-mars-vQyoZCSNjaI-JqxekyhmQi1.300x300.jpg", "episode_title": "544- Chick Tracts", "podcast_title": "99% Invisible"}